# language:ru
@eldorado @all
Функционал: Эльдорадо

  Предыстория:
    * открытие поисковика "Гугл"

  Сценарий: Эльдорадо

    * открывается страница "Гугл"
    * пользователь в поле "Строка поиска" вводит значение "Эльдорадо" и нажимает Enter
    * открывается страница "Результаты поиска Гугл"
    * проверяет, что на странице содержится текст "Эльдорадо - интернет-магазин электроники, цифровой и ..."
    * кликает по гиперссылке с текстом "Эльдорадо - интернет-магазин электроники, цифровой и ..."
    * открывается страница "Эльдорадо"
    * пользователь в поле "Строка поиска" вводит значение "Ноутбук Apple MacBook Pro 13 M1/8/256 Space Gray (MYD82RU/A)" и нажимает Enter
    * открывается страница "Нажмите «Разрешить» в углу экрана"
    * пользователь нажимает элемент "Закрыть"
    * открывается страница "Эльдорадо"
    * пользователь нажимает элемент "Добавить в корзину"
    * пользователь нажимает элемент "Корзина с покупками"
    * открывается страница "Корзина Эльдорадо"
    * проверяет, что на странице содержится текст "Ноутбук Apple MacBook Pro 13 M1 8-core (8-core GPU)/8/256 Space Gray (MYD82RU/A)"
    * пользователь нажимает кнопку "Удалить"
    * пользователь проверяет, что значение поля "Всего к оплате" содержит "0"

